{
  "items": [
    {
      "title": "Система числення",
      "formula": "",
      "tags": "арифметика",
      "description": "
        Нумерація

        Системою числення, або нумерацією, називається сукупність правил і знаків, за допомогою яких можна відобразити будь-яке невід'ємне число.

        Завдання всякої нумерації — зобразити будь-яке натуральне число за допомогою невеликої групи спеціальних знаків (цифр).

        Цифри

        Цифри (від арабського «сифр») — знаки для запису чисел. Слово «цифра» без уточнення зазвичай означає один з наступних знаків: 0 1 2 3 4 5 6 7 8 9 (так звані «арабські цифри»).

        Існують також багато інших варіантів: римські цифри (I V X L C D M), шістнадцяткові цифри (0 1 2 3 4 5 6 7 8 9 A B C D E F), у деяких мовах, наприклад, в івриті, в давньогрецькій та церковнослов'янській мовах, існує система запису чисел буквами.

        Арабсько-індійські цифри

        Родоначальницею нашої сучасної нумерації була, очевидно, нумерація, що виникла в Індії. На жаль, дуже мало відомо про те, як і коли в Індії почали позначати числа за позиційним принципом. З Індії ця система поширилася в інші країни. Деякі народи запозичили в індійців тільки позиційний принцип, зберігши своє старе написання цифр (наприклад, китайці), інші — запозичили в індійців і їх цифри.

        Вже в 874 р. з’явились рукописи арабською мовою, які містили індійський позиційний запис чисел. Індійські, або, як їх іноді називають арабсько-індійські цифри пізніше поширились на всьому мусульманському сході, а також у мавританських країнах (територія сучасної Іспанії). Вони й стали прямими родоначальниками наших цифр.
      "
    }, {
      "title": "Прості та складені числа",
      "formula": "",
      "tags": "арифметика",
      "description": "
        Просте число

        Просте число — це натуральне число, яке має рівно два різних натуральних дільники (лише 1 і саме число).

        Послідовність простих чисел починається так: 2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71, 73, 79, 83, 89, 97, 101, 103, 107, 109, 113 , 127, 131, 137, 139, 149, …

        Складене число

        Складене число — натуральне число, яке більше 1 і не є простим. Кожне складене число є добутком двох натуральних чисел, більших 1.

        Послідовність складених чисел починається так: 4, 6, 8, 9, 10, 12, 14, 15, 16, 18, 20, 21, 22, 24, 25, 26, 27, 28, 30, 32, 33, 34, 35, 36, 38, 39, 40, 42, 44, 45, 46, 48, 49, 50, 51, 52, 54, 55, …

        Будь-яке складене число може бути єдиним чином розкладене в добуток простих множників.

        Основна теорема арифметики

        Будь-яке натуральне число більше одиниці може бути представлене у вигляді добутку простих чисел і таке представлення є єдиним з точністю до порядку множників.

        Розклад натуральних чисел на добуток простих

        Представлення натурального числа у вигляді добутку простих називають розкладом на прості або факторизацією числа.
      "
    }, {
      "title": "Найбільший спільний дільник та найменше спільне кратне",
      "formula": "",
      "tags": "арифметика",
      "description": "
        Найбільший спільний дільник (НСД) — найбільше натуральне число, на яке без остачі ділиться кожне з даних. Наприклад,

        НСД(16,20,28)=4.
        Щоб знайти НСД двох або кількох чисел, необхідно:

        розкласти дані числа на прості множники;
        скласти добуток усіх спільних простих множників;
        обчислити складений добуток.
        Найменше спільне кратне (НСК) — найменше натуральне число, яке ділиться на кожне з даних чисел. Наприклад,

        НСК(2,3,4)=12.
        Щоб знайти НСК двох чисел, необхідно:

        розкласти дані числа на прості множники;
        скласти добуток усіх простих множників;
        обчислити складений добуток.
      "
    }, {
      "title": "Дроби",
      "formula": "",
      "tags": "арифметика",
      "description": "
        Якщо частка від ділення одного виразу на інший не є цілим виразом, її записують у вигляді дробу.

        Дробом називають частку від ділення двох виразів, записану за допомогою дробової риски.

        Які б не були вирази A і B, їх частка AB — дріб. Вирази A і B — члени цього дробу, A — чисельник, B — знаменник.

        Звичайний дріб — дріб, члени якого — натуральні числа.

        Основна властивість дробу

        Якщо чисельник і знаменник дробу помножити на один і той самий вираз, то дістанемо дріб, який тотожно дорівнює даному. Іншими словами: при будь-яких натуральних a, b і m
        a⋅mb⋅m=ab
      "
    }, {
      "title": "Відсотки, проценти",
      "formula": "",
      "tags": "арифметика",
      "description": "
        Відсотком (від латинського pro cento — зі сотні) або також процентом називається сота частина. Запис 1% означає 0,01; 27%=0,27; 100%=1; 150%=1,5 і т. д.

        1% від зарплати означає 0,01 зарплати; виконати весь план — означає виконати 100% плану; виконання 150% плану означає виконання 1,5 плану і т. д.

        Щоб виразити число в процентах, потрібно помножити це число на 100 (або, що те саме, перенести в ньому кому на два знаки вправо).

        Приклади

        Процентний вираз числа 2 є 200%; числа 0,357 є 35,7%; числа 1,753 є 175,3%.

        Щоб знайти число за його процентним виразом, потрібно розділити процентний вираз на 100 (або, що те саме, перенести кому на два знаки вліво).

        Приклади

        13,5%=0,135;
        2,3%=0,023;
        145%=1,45;
        25%=0,4%=0,004.
      "
    }, {
      "title": "Середні величини",
      "formula": "",
      "tags": "арифметика",
      "description": "
        Середнє арифметичне

        Середнє арифметичне n чисел a1,a2,…,an — частка від ділення суми цих чисел на їх кількість:

        Ср.ар.=a1 + a2 + ... + ann.
        Наприклад, середнє арифметичне чисел 83, 87, 81, 90 дорівнює

        Ср.ар.=83+87+81+904=8514=85,25.
        Арифметичне середнє не менше від середнього геометричного.

        Середнє геометричне

        Середнє геометричне n чисел a1,a2…an дорівнює кореню n-го степеня із добутку даних чисел:

        Ср.геом.=a1 ⋅ a2 ⋅ ... ⋅an‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾√n.
        Наприклад, середнє геометричне чисел 40, 50, 82 дорівнює

        Ср.геом.=40 ⋅ 50 ⋅ 82‾‾‾‾‾‾‾‾‾‾‾‾‾√3=164000‾‾‾‾‾‾‾√3≈54,7370.
      "
    }, {
      "title": "Міри довжини",
      "formula": "",
      "tags": "арифметика",
      "description": "
        Одиниці вимірювання довжини

        Відстані вимірюють різними одиницями довжини: великі відстані — більшими одиницями, а невеликі — меншими.

        Метр — основна одиниця довжини. Метр коротко позначається м, тобто 1 метр записується 1 м.
        Дециметр (дм) — десята частина метра.
        Сантиметр (см) — десята частина дециметра, або сота частина метра.
        Міліметр (мм) — десята частина сантиметра, або тисячна частина метра.
        Довжину значної величини, зазвичай, записують у кілометрах, короткий запис — 1 км.

        Приклад

        1 км = 1000 м = 10000 дм = 100 000 см = 1 000 000 мм.

        Лінійка — найпростіший вимірювальний інструмент. Зазвичай лінійка має нанесені поділки, кратні тим одиницям вимірювання довжини (сантиметри, дюйми), які використовуються для вимірювання відстаней.

        Співвідношення стародавніх мір довжини

        Тривалий час на території України користувалися такими одиницями вимірювання довжини:

        1 верста = 1,067 км;
        1 сажень = 3 аршини = 2,134 м;
        1 аршин = 16 вершків = 0,711 м = 71,1 см;
        1 вершок = 4,445 см.
        Деякі англійські міри довжини

        1 миля (статутна) = 1760 ярдів = 5280 футів = 1609,344 м;
        1 дюйм = 2,54 см;
        1 фут = 12 дюймів = 0,3048 м;
        1 ярд = 3 фути = 0,9144 м.
      "
    }, {
      "title": "Формули скороченого множення",
      "formula": "",
      "tags": "алгебра",
      "description": "
        Формули скороченого множення — поширені випадки множення многочленів. Багато з них є окремими випадками біному Ньютона.

        Формули скороченого множення дозволяють не тільки скоротити проміжні розрахунки. Вони використовуються для розкладення багаточленів на множники. А це, в свою чергу, полегшує розв'язання рівнянь.

        Формули для квадратів

        Формули для квадратів застосовують в обчисленнях найчастіше.

        a2−b2=(a−b)(a+b)
        (a+b)2=a2+2ab+b2
        (a−b)2=a2−2ab+b2
        (a+b+c)2=a2+b2+c2+2ab+2ac+2bc
        (a−b−c)2=a2+b2+c2−2ab−2ac+2bc
        Формули для кубів

        a3+b3=(a+b)(a2−ab+b2)
        a3−b3=(a−b)(a2+ab+b2)
        (a+b)3=a3+3a2b+3ab2+b3
        (a−b)3=a3−3a2b+3ab2−b3
        Формули для четвертого степеня

        (a+b)4=a4+4a3b+6a2b2+4ab3+b4
        (a−b)4=a4−4a3b+6a2b2−4ab3+b4
      "
    }, {
      "title": "Степені і корені",
      "formula": "",
      "tags": "алгебра",
      "description": "
        1. Степінь з натуральним показником

        am⋅an=am+n
        aman=am−n
        (a⋅b)n=an⋅bn
        (am)n=am⋅n
        (ab)n=anbn
        Якщо a>b,b>0, то

        an>bn.

        Степінь з цілим показником

        a−n=1an,
        де a≠0, n — ціле.

        a0=1
        3. Степінь з раціональним показником

        amn=am‾‾‾√n,
        де a>0, m — ціле, n — натуральне.

        4. Арифметичний корінь

        a2‾‾‾√=|a|
        a⋅b‾‾‾‾√=a‾‾√⋅b‾‾√
        ab‾‾√=a‾‾√b‾‾√
        b2⋅a‾‾‾‾‾‾√=|b|a‾‾√
        Якщо

        a‾‾√n=b,
        то

        bn=a, b≥0.
        a‾‾√k‾‾‾√n=a‾‾√nk
        ak‾‾‾√n=(a‾‾√n)k

        Винесення множника з-під знака кореня

        Підкореневий вираз розкладіть на множники, серед яких є квадрати виразів.
        Застосуйте теорему про корінь з добутку.
        Знайдіть добуток одержаних множників.
        Запишіть відповідь.
        Внесення множника під знак кореня

        Множник перед знаком кореня піднесіть до квадрата.
        Запишіть одержаний квадрат під знаком даного кореня.
        Знайдіть добуток виразів під знаком кореня.
        Запишіть відповідь.
      "
    }, {
      "title": "Рівняння",
      "formula": "",
      "tags": "алгебра",
      "description": "
        Рівність, що містить змінні (невідомі), називається рівнянням.

        Областю визначення, або областю допустимих значень даного рівняння називається множина всіх значень змінних, при яких вирази, що входять у це рівняння, мають смисл.

        Коренем рівняння з однією змінною називається таке значення цієї змінної, при якому рівняння перетворюється у правильну рівність.

        Два (або більше) рівняння називаються рівносильними (еквівалентними), якщо кожен корінь одного рівняння є коренем другого і навпаки.

        1. Лінійні рівняння

        ax+b=c,a≠0
        Розв'язок

        x=c−ba.

        2. Квадратні рівняння

        ax2+bx+c=0.
        Якщо a рівне нулю, то це рівняння зводиться до попереднього.

        Дискримінант

        D=b2−4ac.
        Якщо

        D≥0,
        то розв'язки:

        x1=−b+D‾‾√2a
        x2=−b−D‾‾√2a
        Якщо D<0, то розв'язків немає.

        Рівняння виду

        x2+px+q=0
        називається зведеним квадратним рівнянням. Для зведеного квадратного рівняння справедливі рівності:

        x1+x2=−p  — теорема Вієта
        x1⋅x2=q
        Звідси випливає:

        ax2+bx+c=a(x−x1)(x−x2).
      "
    }, {
      "title": "Системи рівнянь",
      "formula": "",
      "tags": "алгебра",
      "description": "
        Система двох рівнянь першого степеня з двома невідомими

        Способи розв'язання

        1. Спосіб підстановки полягає в тому, що:

        1) із одного рівняння ми знаходимо вираз одного з невідомих, наприклад x, через відомі величини і інше невідоме y;

        2) знайдений вираз підставляємо в інше рівняння, в якому після цієї підстановки буде міститися тільки одна невідома y;

        3) розв'язуємо отримане рівняння і знаходимо значення y;

        4) підставляючи знайдене значення y у вираз невідомого x, знайдений на початку розв'язку, отримуємо значення x.

        2. Спосіб додавання або віднімання полягає в тому, що:

        1) обидві частини одного рівняння множаться на деякий множник; обидві частини іншого рівняння множаться на інший множник; ці множники підбираються так, щоб коефіцієнти при одному із невідомих в обидвох рівняннях після їх множення на ці множники мали одну і ту ж абсолютну величину;

        2) додаємо два рівняння або віднімаємо їх один від одного, дивлячись на те, має рівняння коефіцієнти різні або однакові знаки; цим одне із невідомих виключається;

        3) розв'язуємо отримане рівняння з одним невідомим;

        4) інше невідоме можна знайти тим же чином, але легше підставити значення першого невідомого в будь-яке із даних рівняннь і розв'язати рівняння з одним невідомим.

        Загальні формули і особливі випадки розв'язування системи

        Розв'язати систему рівнянь виду

        {ax+by=ca1x+b1y=c1
        можна швидше, якщо застосовувати загальні формули. Останні можна отримати будь-яким способом, наприклад, способом додавання і віднімання. Розв'язок буде мати вигляд

        x=b1c−bc1ab1−a1b
        y=ac1−a1cab1−a1b
        При розв'язуванні системи рівнянь можуть виникнути три різних випадки.

        Коефіцієнти при невідомих непропорційні:

        aa1≠bb1
        Тоді, якими б не були вільні члени, рівняння має єдиний розв'язок, який наведений вище.

        Коефіцієнти при невідомих пропорційні:

        a/a1=b/b1
        Тоді важливо знати, чи знаходяться в тому ж відношенні і вільні члени. Якщо знаходяться:

        a/a1=b/b1=c/c1
        то система рівнянь має безліч розв'язків. Причина цього та, що в розглянутому випадку одне із рівнянь є наслідком іншого, так що фактично в нас одне рівняння, а не два.

        Коефіцієнти при невідомих пропорційні, але вільні члени не знаходяться в тому ж відношенні:

        a/a1=b/b1≠c/c1
        Тоді система не має розв'язку, тому що рівняння один одному протирічять.

        Система трьох рівнянь першого степеня з трьома невідомими

        Розв'язання системи трьох рівнянь з трьома невідомими основується на тих же прийомах, що і розв'язування системи двох рівнянь з двома невідомими.
      "
    }, {
      "title": "Нерівності",
      "formula": "",
      "tags": "алгебра",
      "description": "
        Два вирази або числа, з’єднані знаком >, <, ≥ або ≤, утворюють нерівність.

        Нерівності, що містять знаки > або <, називаються строгими, а нерівності, що містять знаки ≥ або ≤, називаються нестрогими.

        Вказівки до розв’язування нерівностей з однією змінною

        1. Нерівності з однією змінною мають вигляд:

        f(x)>g(x),
        f(x)<g(x),
        f(x)≥g(x),
        f(x)≤g(x).
        Розв’язком нерівності називається множина значень змінної, при яких дана нерівність буде правильною числовою нерівністю.

        Дві нерівності називаються рівносильними, якщо множини їхніх розв’язків збігаються.

        Основна ідея розв’язування нерівності полягає в заміні нерівності більш простою, але рівносильною заданій.

        2. При розв’язуванні нерівності використовують такі правила перетворення нерівності в рівносильну:

        а) будь-який член нерівності можна перенести з однієї її частини в іншу з протилежним знаком, залишивши при цьому без зміни знак нерівності;

        б) обидві частини нерівності можна помножити або поділити на одне й те саме додатне число, залишивши при цьому без зміни знак нерівності;

        в) обидві частини нерівності можна помножити або поділити на одне й те саме від’ємне число, змінивши при цьому знак нерівності на протилежний;

        г) якщо для одних і тих самих значень  справедливі нерівності

        f(x)>0,g(x)>0  і  f(x)>g(x),
        то для тих самих значень x виконується нерівність

        (f(x))n>(g(x))n, n∈ℕ.
        3. Нехай задана нерівність має вигляд

        f(x)g(x)>0
        (замість знака > можуть бути знаки <, ≥, ≤, а функція в знаменнику може бути сталою) або вона приведена до цього вигляду за допомогою правил вказівки 2.

        Для розв’язування нерівності застосовується метод інтервалів (метод проміжків), який полягає в тому, що:

        а) на числову вісь наносять точки

        x1,x2,...,xn
        що розбивають її на проміжки, в яких вираз

        f(x)g(x),
        визначено і зберігає знак (плюс або мінус). Такими точками можуть бути корені рівнянь

        f(x)=0  і  g(x)=0.
        Відповідні цим кореням точки позначають на числовій осі: зафарбованими кружками — точки, що задовольняють задану нерівність, а світлими кружками — точки, що не задовольняють її;

        б) відшукують і позначають на числовій осі знак виразу

        f(x)g(x),
        для значень x, які належать кожному з одержаних проміжків. Якщо функції

        f(x)  і  g(x)
        є многочленами і не містять множників виду

        (x−a)2n, де n∈ℕ,
        то достатньо визначити знак функції

        f(x)g(x)
        в будь-якому такому проміжку, а в решті проміжків знаки плюс і мінус будуть чергуватися.

        Якщо ж у чисельнику і знаменнику дробу

        f(x)g(x)
        є множник виду

        (x−a)2n, де n∈ℕ,
        то, покладаючи x≠a, ділять обидві частини заданої нерівності на множник

        (x−a)2n,
        додатний при всіх значеннях x≠a, (дивіться вказівку 2), і безпосередньою перевіркою з’ясовують, чи задовольняє значення x=a задану нерівність.

        4. Розглянемо розв’язування квадратної нерівності

        ax2+bx+c>0   (1)
        у випадку від’ємного дискримінанта квадратного тричлена

        ax2+bx+c  (D=b2−4ac<0).
        Якщо a>0, то нерівність (1) виконується при всіх значеннях x.

        Якщо ж a<0, то нерівність не виконується ні при якому значенні x.

        5. Ірраціональна нерівність

        f(x)‾‾‾‾√<g(x)   (2)
        рівносильна системі нерівностей

        ⎧⎩⎨⎪⎪f(x)≥0g(x)>0(f(x)‾‾‾‾√)2<(g(x))2   (3)
        6. Ірраціональна нерівність

        f(x)‾‾‾‾√>g(x)   (4)
        рівносильна сукупності двох систем нерівностей

        ⎧⎩⎨⎪⎪f(x)≥0g(x)≥0(f(x)‾‾‾‾√)2>(g(x))2
        (5)
        {f(x)≥0g(x)<0
        7. Показникова нерівність

        af(x)>ag(x)   (6)
        При a>1 рівносильна нерівності

        f(x)>g(x)   (7)
        а при 0<a<1 — нерівності

        f(x)<g(x)   (8)
        8. Логарифмічна нерівність

        logaf(x)>logag(x)   (9)
        При a>1 рівносильна системі нерівностей

        ⎧⎩⎨⎪⎪f(x)>0g(x)>0f(x)>g(x)   (10)
        а при 0<a<1 — системі нерівностей

        ⎧⎩⎨⎪⎪f(x)>0g(x)>0f(x)<g(x)      (11)
      "
    }, {
      "title": "Функції",
      "formula": "",
      "tags": "алгебра",
      "description": "
        Така залежність між змінними x та y, в якій кожному значенню змінної x із деякої множини D відповідає єдине значення змінної y, називається функціональною залежністю, або функцією.

        Приклади

        Залежність між натуральними числами та їх квадратами називається функціональною залежністю.
        Якщо кожному натуральному числу поставити у відповідність число, йому протилежне, то одержимо функціональну відповідність.
        y=2x−3, де x — аргумент, незалежна змінна; y — функція, залежна змінна (бо кожному значенню змінної x відповідає єдине значення змінної y).
        Змінну x називають аргументом даної функції, чи незалежною змінною. Змінну y називають функцією від x, чи залежною змінною.

        Способи задання функції:

        Описанням, наприклад, кожному натуральному числу поставлено у відповідність його квадрат.
        Формулою, наприклад, s=v⋅t, y=2x−3.
        Таблицею, наприклад,
        x 1 2 3 4 5
        y −1  1 6 5 7
        Графіком.

        Область визначення функції — це множина всіх значень змінної x, при яких функція має зміст.

        З'ясуємо, як знайти область визначення деяких функцій, заданих формулою.

        Якщо функція — многочлен, то вона існує при будь-яких значеннях аргумента, тобто її область визначення — всі дійсні числа.
        Якщо функція задана формулою, яка містить аргумент у знаменнику дробу, то до області визначення функції входять всі дійсні числа, крім тих, які перетворюють знаменник в нуль.
        Якщо функція задана формулою, яка містить арифметичний квадратний корінь, то до області її визначення входять всі дійсні числа, при яких підкореневий вираз набуває невід'ємних значень.
        Елементарні функції

        1. Пряма пропорційність

        Пряма пропорційність

        y=k⋅x,
        k — число. Графік — пряма, що проходить через початок координат під кутом до осі абсцис

        tgα=k.
        2. Лінійна функція

        Лінійна функція

        y=k⋅x+l,
        k, l — числа. Графік — пряма, що перетинає вісь абсцис у точці

        (−lk; 0),
        ординат — (0; l).

        3. Обернена пропорційність

        Обернена пропорційність

        y=kx
        Графік — гіпербола.

        4. Квадратична функція

        Квадратична функція

        y=ax2+bx+c,
        a (a≠0), b, c — числа.

        Графік — парабола.

        5. Степенева функція

        Степенева функція

        y=xp.
        Якщо p — натуральне і парне, то графік симетричний відносно осі OY; натуральне і непарне — відносно початку координат; від'ємне і непарне — гіпербола в 1 і 3-й координатних чвертях; від'ємне і парне — гіпербола в 1 і 4-й координатних чвертях.
      "
    }, {
      "title": "Логарифм",
      "formula": "",
      "tags": "алгебра",
      "description": "
        Логарифмом числа b за основою a називається показник степеня x, до якого слід піднести основу a, щоб одержати число b, де a>0,a≠1,b>0:

        logab=x
        Якщо основа дорівнює 10, то такий логарифм називається десятковим і позначається

        lgb=x
        без вказання основи.

        Якщо основа логарифма дорівнює числу e, то логарифм називається натуральним і записується

        lnb=x
        Основна логарифмічна тотожність

        b=alogab,b>0.
        Властивості логарифму:

        1)
        logaa=1
        2)
        loga1=0
        3)
        loga(b⋅c)=logab+logac
        4)
        loga(bc)=logab−logac
        5)
        logaxp=p⋅logax
        6)
        logax=logbxlogba
        (формула переходу до нової основи)
        7)
        logab=1logba
        8)
        logab=logapbp=p⋅logapb
        9)
        alogab=b
        10)
        logca⋅logab=logcb
        11)
        logaαbβ=βα⋅logab
        12)
        alogcb=blogca
        13)
        logaαb=logablogaaα=1α⋅logab
        14)
        logcalogcb=logcblogca
        15)
        logcb⋅logca=logca⋅logcb
      "
    }, {
      "title": "Послідовності",
      "formula": "",
      "tags": "алгебра",
      "description": "
        Поняття числової послідовності

        Нехай кожному натуральному числу n відповідає по деякому правилу число an. Кажуть, що задана числова послідовність

        a1,a2,...,an,...
        Числа a1,a2,... називаються членами послідовності; an – n-й або загальний член послідовності. Саму послідовність позначають так: (an).

        Таким чином, числовою послідовністю (an) (або, коротше, послідовністю) називається функція, задана на множині натуральних чисел.

        Наприклад, якщо відомо, що

        an=n2
        при будь-якому n, то a1=1,a2=4,a3=9 і т.д.

        Деякі способи задання послідовності

        1) Аналітичний спосіб задання послідовності. Задати послідовність аналітично – це означає вказати формулу, яка дозволяє по номеру члена послідовності однозначно визначити цей член. Формула, яка дозволяє обчислити будь-який член послідовності по його номері, називається формулою загального члена числової послідовності.

        Наприклад, формула загального члена

        an=(−1)n−1n,
        задає наступну числову послідовність

        1,−12,13,−14,15,...
        2) Інколи послідовність задається рекурентною формулою, яка дозволяє знаходити члени послідовності по відомим попереднім членам. Наприклад, розглянемо послідовність (an), перший член якої рівний 1, другий 2, а кожний член, починаючи з третього, рівний сумі двох попередніх членів:

        a1=1,a2=2,an+2=an+an+1.
        Тоді

        a3=1+2=3,
        a4=2+3=5,
        a5=3+5=8
        і т.д. Значить, послідовність (an) задана.

        3) Послідовність може бути також задана описом способу отримання її членів. Так, наприклад, говорять, що послідовність

        3,1;3,14;3,141;3,1415;...
        Утворена із приблизних значень числа π з недостачею з точністю до

        0,1;0,01;0,001;0,0001;...
        і т.д. В подібних випадках, як правило, не можна вказати ні формули загального члена послідовності, ні рекурентного способу обчислення її членів.

        Монотонні послідовності

        Послідовність (an) називається зростаючою, якщо кожен її член, починаючи з другого, більший за попередній, тобто якщо для будь-якого натурального n виконується нерівність

        an+1>an.
        Послідовність (an) називається спадною, якщо кожен її член, починаючи з другого, менший за попередній, тобто якщо для будь-якого натурального n виконується нерівність

        an+1<an.
        Послідовність (an) називається неспадною, якщо кожен її член, починаючи з другого, не менший за попередній, тобто якщо для будь-якого натурального n виконується нерівність

        an+1≥an.
        Послідовність (an) називається незростаючою, якщо кожен її член, починаючи з другого, не більший за попередній, тобто якщо для будь-якого натурального n виконується нерівність

        an+1≤an.
        Зростаючі, спадні, неспадні та незростаючі послідовності називаються монотонними послідовностями.

        Зростаючі та спадаючі послідовності називають строго монотонними.

        Нижня та верхня межа

        Послідовність (an) називається обмеженою знизу, якщо існує таке число A, що для кожного члена послідовності справджується нерівність an>A. Число A називається нижньою межею послідовності (an).

        Послідовність (an) називається обмеженою зверху, якщо існує таке число B, що для кожного члена послідовності справджується нерівність an<B. Число B називається верхньою межею послідовності (an).
      "
    }, {
      "title": "Арифметична прогресія",
      "formula": "a1,a2,a3,...,an",
      "tags": "алгебра",
      "description": "
        1. Арифметична прогресія

        a1,a2,a3,...,an, де n − ціле.
        Нехай a1 — перший член прогресії, d — різниця прогресії, n — число членів, an — n-ий член, Sn — сума n перших членів.

        Тоді n-й член арифметичної прогресії:

        an=a1+d(n−1).

        Різниця арифметичної прогресії:

        d=an+1−an.
        Сума перших n членів:

        Sn=12(2a1+d(n−1))n.
      "
    }, {
      "title": "Геометрична прогресія",
      "formula": "b1,b2,b3,...,bn",
      "tags": "алгебра",
      "description": "
        1. Геометрична прогресія

        b1,b2,b3,...,bn, де n − ціле.
        Нехай b1 — перший член, q — знаменник, відмінний від нуля, n — число членів, bn — n-й член, Sn — сума n перших членів, S — сума нескінченної геометричної прогресії.

        Тоді n-й член геометричної прогресії:

        bn=b1⋅q^(n−1).

        Знаменник геометричної прогресії:

        q=bn/bn−1.
        Сума перших n членів:

        Sn=b1(1−q^n)/(1−q), q≠1.

        Мають місце наступні рівності:

        b2k=bk−1⋅bk+1, де
        k=2,3,n−1.
        bk⋅bm=bp⋅bq, де
        k+m=p+q.
        Сума нескінченної геометричної прогресії:

        S=b1/(1−q), де |q|<1.
      "
    }, {
      "title": "Комбінаторика",
      "formula": "",
      "tags": "алгебра",
      "description": "
        Основне правило комбінаторики

        Нехай необхідно виконати послідовно k дій. Якщо першу дію можна виконати n1 способами, другу — n2 способами і так далі до k-ї дії, яку можна виконати nk способами, то всі k дій можна виконати n1 ⋅ n2 ⋅ ... ⋅ nk способами.

        Приклад 1.

        Скількома способами на першості світу з футболу можуть розподілитися медалі, якщо у фінальній частині грають 24 команди?

        Розв'язок. Золоту медаль може одержати будь-яка з 24-х команд, тобто 24 можливості. Срібну медаль може виграти одна з 23-х команд, а бронзову — одна з 22-х команд. За основним правилом комбінаторики загальне число способів розподілу медалей 24 · 23 · 22 = 12144.

        Скорочення n!=1 ⋅ 2 ⋅ 3 ⋅ ... ⋅ (n−1) ⋅ n називається факторіалом числа n (читається n-факторіал).

        Упорядковані множини, які відрізняються одна від одної лише порядком своїх елементів (тобто можуть бути одержані з однієї і тієї ж множини лише перестановкою своїх елементів), називаються перестановками. Позначимо число всіх перестановок n-елементної множини Pn.

        Pn=1 ⋅ 2 ⋅ ... ⋅ (n−1) ⋅n=n!
        Приклад 2.

        Скількома різними способами можна розмістити п'ять книжок на книжковій полиці?

        Розв'язок. Шукане число розміщень є числом способів упорядкування множини з п'яти елементів. Значить, це число дорівнює P5 = 1 · 2 · 3 · 4 · 5 = 120.

        Число різних m-елементних підмножин n-елементної множини становить

        Cmn=n!m! (n−m)!
        C0n=1
        Число Cmn називається числом комбінацій або сполучень із n елементів по m елементів.

        Кожна впорядкована підмножина, яка містить m елементів даної множини з n елементів, називається розміщенням із n по m елементів. Таким чином, два різних розміщення із даних n елементів по m відрізняються один від одного або складом елементів, або порядком їх розміщення.

        Кількість упорядкованих m-елементних підмножин n-елементної множини, всі m елементів якої різні, становить

        Amn=Pm⋅Cmn=n!(n−m)!

        Приклад 3.

        Скількома різними способами можна розмістити п'ять учнів в аудиторії, яка має 20 місць?

        Розв'язок. Шукане число способів дорівнює числу розміщень із 20 елементів, по 5 елементів, тобто A520 = 16 · 17 · 18 · 19 · 20 = 1860480.

        Кількість різних комбінацій із n елементів по m елементів з повтореннями становить

        Cn−1n+m−1=Cmn+m−1
      "
    }, {
      "title": "Комплексні числа",
      "formula": "",
      "tags": "алгебра",
      "description": "
        Основне правило комбінаторики

        Нехай необхідно виконати послідовно k дій. Якщо першу дію можна виконати n1 способами, другу — n2 способами і так далі до k-ї дії, яку можна виконати nk способами, то всі k дій можна виконати n1 ⋅ n2 ⋅ ... ⋅ nk способами.

        Приклад 1.

        Скількома способами на першості світу з футболу можуть розподілитися медалі, якщо у фінальній частині грають 24 команди?

        Розв'язок. Золоту медаль може одержати будь-яка з 24-х команд, тобто 24 можливості. Срібну медаль може виграти одна з 23-х команд, а бронзову — одна з 22-х команд. За основним правилом комбінаторики загальне число способів розподілу медалей 24 · 23 · 22 = 12144.

        Скорочення n!=1 ⋅ 2 ⋅ 3 ⋅ ... ⋅ (n−1) ⋅ n називається факторіалом числа n (читається n-факторіал).

        Упорядковані множини, які відрізняються одна від одної лише порядком своїх елементів (тобто можуть бути одержані з однієї і тієї ж множини лише перестановкою своїх елементів), називаються перестановками. Позначимо число всіх перестановок n-елементної множини Pn.

        Pn=1 ⋅ 2 ⋅ ... ⋅ (n−1) ⋅n=n!
        Приклад 2.

        Скількома різними способами можна розмістити п'ять книжок на книжковій полиці?

        Розв'язок. Шукане число розміщень є числом способів упорядкування множини з п'яти елементів. Значить, це число дорівнює P5 = 1 · 2 · 3 · 4 · 5 = 120.

        Число різних m-елементних підмножин n-елементної множини становить

        Cmn=n!m! (n−m)!
        C0n=1
        Число Cmn називається числом комбінацій або сполучень із n елементів по m елементів.

        Кожна впорядкована підмножина, яка містить m елементів даної множини з n елементів, називається розміщенням із n по m елементів. Таким чином, два різних розміщення із даних n елементів по m відрізняються один від одного або складом елементів, або порядком їх розміщення.

        Кількість упорядкованих m-елементних підмножин n-елементної множини, всі m елементів якої різні, становить

        Amn=Pm⋅Cmn=n!(n−m)!

        Приклад 3.

        Скількома різними способами можна розмістити п'ять учнів в аудиторії, яка має 20 місць?

        Розв'язок. Шукане число способів дорівнює числу розміщень із 20 елементів, по 5 елементів, тобто A520 = 16 · 17 · 18 · 19 · 20 = 1860480.

        Кількість різних комбінацій із n елементів по m елементів з повтореннями становить

        Cn−1n+m−1=Cmn+m−1
      "
    }, {
      "title": "Границя функції",
      "formula": "",
      "tags": "алгебра",
      "description": "
        Поняття границі функції

        Нехай функція f(x) визначена у всіх точках проміжку (a;b), за винятком, можливо, деякої точки x0∈(a;b). Побудуємо послідовність значень аргументу функції f(x):

        x1,x2,...,xn,...,n∈ℕ,(xn≠x0) (1)
        таку, щоб всі члени послідовності належали проміжку (a;b) і послідовність збігалась до точки x0:

        limn→∞xn=x0.
        Тоді значення функції f(x)
        f(x1),f(x2),...,f(xn),... (2)
        також утворять деяку числову послідовність.

        Говорять, що число A є границею функції f(x) при x, що прямує до x0, якщо для будь-якої послідовності значень аргументу (1), яка збігається до числа x0, послідовність значень функції (2) збігається до числа A, і пишуть

        limx→x0f(x)=A.

        Примітка. Це визначення границі функції називається визначенням границі по Гейне.
        Існує й інше, еквівалентне тому, що вище, визначення границі функції.

        Говорять, що число A є границею функції f(x) при x, що прямує до x0, якщо для будь-якого додатнього числа ε знайдеться таке додатне число δ, яке залежить від ε, що при всіх x∈(a;b), які задовільняють нерівність

        0<|x−x0|<δ,
        виконується нерівність

        |f(x)−A|<ε.
        Примітка. Це визначення границі функції називається визначенням границі по Коші.
      "
    }, {
      "title": "Похідна функції",
      "formula": "",
      "tags": "алгебра",
      "description": "
        Похідною функції f у точці x0 називається границя, до якої прямує відношення

        Δf/Δx=(f(x0+Δx)−f(x0))/Δx,
        якщо Δx наближається до нуля.

        Отже,

        f′(x0)=limΔx→0((f(x0+Δx)−f(x0))/Δx).
        Функція, яка має похідну в точці x0, називається диференційованою в цій точці.

        Поняття похідної та диференційованості функції в точці є тотожними. Тому часто операцію знаходження похідної називають диференціюванням функції.
      "
    }
  ]
}